from pyrogram import Client, filters
from pyrogram.types import (
    InlineKeyboardMarkup,
    InlineKeyboardButton
)
from database import get_role

keyboard = InlineKeyboardMarkup([
    [InlineKeyboardButton("{ 1 }", callback_data="m1"),
     InlineKeyboardButton("{ 2 }", callback_data="m2")],
    [InlineKeyboardButton("{ 3 }", callback_data="m3"),
     InlineKeyboardButton("{ 4 }", callback_data="m4")],
    [InlineKeyboardButton("{ 5 }", callback_data="m5"),
     InlineKeyboardButton("{ 6 }", callback_data="m6")],
    [InlineKeyboardButton("{ م مطور }", callback_data="dev"),
     InlineKeyboardButton("{ الالعاب }", callback_data="games")],
    [InlineKeyboardButton("{ اوامر التسلية }", callback_data="fun")],
    [InlineKeyboardButton("{ القفل / الفتح }", callback_data="aldl"),
     InlineKeyboardButton("{ التعطيل / التفعيل }", callback_data="aldl2")],
])


@Client.on_message(filters.group & filters.regex(r"^الاوامر$"))
async def ShowCommands(client, message):
    sender = message.from_user
    chat = message.chat

    sender_role = get_role(chat.id, sender.id)
    if sender_role is None:
        sender_role = 9


    # فقط ادمن (7) وأعلى
    if sender_role > 7:
        await message.reply_text(
            "** يجب ان تكون ادمن **"
        )
        return

    bot = await client.get_me()

    # نجيب اخر صورة بروفايل للبوت
    photos = [p async for p in client.get_chat_photos(bot.id, limit=1)]

    caption_text = """
• **اوامــر البــوت الرئيسيـة**

• { م1 } ← اوامر الحمايه
• { م2 } ← اوامر الادمنيه
• { م3 } ← اوامر المدراء
• { م4 } ← اوامر المنشئين
• { م5 } ← اوامر المالكين
• { م6 } ← اوامر التسليه
• { م المطور } ← اوامر المطور
"""

    if photos:
        await message.reply_photo(
            photo=photos[0].file_id,
            caption=caption_text,
            reply_markup=keyboard
        )
    else:
        await message.reply_text(
            caption_text,
            reply_markup=keyboard
        )


@Client.on_callback_query(filters.regex(r"^(m[1-6]|dev|fun|games)$"))
async def menu_handler(client, callback):
    global keyboard
    data = callback.data

    await callback.answer()
    texts = {
        "m1": """
        • اوامر الحمايه كالاتي ...

• قفل ، فتح ← الامر 
• تستطيع قفل حمايه كما يلي ...
• ← { بالتقييد ، بالطرد ، بالكتم }

• الكل ~ الدخول
• الروابط ~ المعرف
• التاك ~ الشارحه
• التعديل ~ تعديل الميديا
• المتحركه ~ الملفات
• الصور ~ الفيديو 

• الماركداون ~ البوتات
• التكرار ~ الكلايش
• السيلفي ~ الملصقات
• الانلاين ~  الدردشه

• التوجيه ~ الاغاني
• الصوت ~ الجهات
• الاشعارات ~ التثبيت 
• الوسائط ~ التفليش
• وسائط المميزين
• الفشار ~ الفارسيه
• الإنكليزيه
• الكفر ~ الاباحي
        """,

        "m2": """
        • اوامر ادمنية الجروب

• رفع/تنزيل مميز
• مسح المميزين
• رفع الادمنية
• تاك – تاك للكل – الجروب
• منع / الغاء منع

• {بالرد – بالمعرف}
• حظر / طرد / كتم / تقييد
• الغاء (حظر – كتم – تقييد)
• كشف / رفع القيود

• عرض القوائم:
المنشئين – المدراء – الادمنية – المميزين  
المشرفين – المكتومين – قائمة المنع

• تثبيت / الغاء تثبيت
• الرابط – الاعدادات – الحماية
• الترحيب – القوانين
• ضع رتبه {الاسم}
• تحكم {بالرد – بالمعرف}

• تفعيل / تعطيل:
الترحيب – الرابط – الردود – الالعاب  
اطردني – التسلية

• مسح:
القوائم – المنع – المميزين  
الرابط – القوانين – الصورة  
مسح {عدد} / {بالرد}

• اوامر الاعضاء:
ايدي – رسائلي – تفاعلي  
لقبي – بايو – ترند  
جهاتي – تعديلاتي – نقاطي  
بيع نقاطي – مسح نقاطي  
قول + كلمة  
زواج – ثنائي اليوم  
الوقت – التاريخ  
الصوتيات – زخرفة – غنيلي  
همسة – صورتي – برجك  
صلاحياتي – رتبتي – نزلني  
صلاحياته / الرتبه / التفاعل / كشف {بالرد – بالمعرف}
        """,

        "m3": """
        • اوامر المدراء

• رفع/تنزيل ادمن
• الادمنية – مسحهم
• تنزيل الكل {بالرد/بالمعرف}
• كشف/طرد/قفل البوتات
• قفل البوتات بالطرد
• فحص البوت
• طرد المحذوفين
• قفل/فتح ارسال القناة

• تغيير رد الرتب:
تغيير رد {رتبه + نص}
مسح رد {رتبه}
(المطور – المالك – المنشئ – المدير – الادمن – المميز – العضو)

• الرتب:
وضع/مسح رتبه {بالرد/بالمعرف}
ضع رتبه {اسم}

• وضع:
اسم – رابط – صورة  
قوانين – وصف – ترحيب

• تفعيل/تعطيل:
الايدي – ايدي بالصورة  
ايدي عضو – البايو  
اسمي – صورتي  
الردود – الابراج  
غنيلي – الصيغ – قول  
تنبيه الاسماء – الصوتيات  
الصوتيات العامة

• مسح:
المحظورين – المطرودين  
المكتومين/المقيدين

• الردود:
اضف/مسح رد  
رد متعدد – مسح الردود المتعددة

• ترتيب الاوامر – استعادتها
• تاك عام / all
• مسح الميديا
• اضف (رسائل/نقاط/تعديلات) + عدد {بالرد}
        """,

        "m4": """• اوامر المنشئ الاساسي

• رفع ، تنزيل ←{ منشئ }
• المنشئين ، مسح المنشئين
• رفع ، تنزيل ←{ مشرف }
• ضع لقب + اللقب ← { بالرد }
• صلاحيات الجروب
• مسح نقاطه ، رسائله ← {بالرد}
• تفعيل ، تعطيل ← منع التصفيه

• اوامر المنشئ الجروب

• رفع ، تنزيل ← { مدير }
• المدراء ، مسح المدراء
• تغيير ، مسح ←{ الايدي }
• تعيين ، مسح ←{ الايدي }
• اضف ، مسح ← { امر }
• الاوامر المضافه ، مسح الاوامر المضافه
• ضع التكرار ← { عدد }
• تفعيل الاوامر ← { اوامر اساسيه }

• تفعيل ، تعطيل ← الاوامر التاليه :
• الردود العامه ، الطرد ، الحظر
• الرفع ، التاك ، نزلني ، ضع رتبه 
• تاك عام ، المسح التلقائي
• ضع عدد المسح + { عدد }""",

        "m5": """
        ︙اوامر مالك الجروب 

• رفع ، تنزيل ←{ مالك }
• المالكين ، مسح المالكين
 •تنزيل جميع الرتب 

• اوامر المالكين 

• رفع ، تنزيل ← { منشئ اساسي }
• المنشئين الاساسيين،
• مسح المنشئين الاساسيين
        """,

        "m6": """
        • اوامر التسلية

• رفع ، تنزيل ← الاوامر التاليه ↓

• غبي 
• سمب
• حمار
• خول
• قرد 
• عره
• متوحد
• متوحده
• كلب 

• اوامر التاك 

• الاغبياء
• الحمير
• الخولات
• السمب
• المتوحدين
• الكلاب
• العرر
• القرود

• اوامر الترفيه 

• زخرفه + النص
• مثال زخرفه محمود
• احسب + عمرك
• مثال احسب 2001/8/5
• معني + الاسم 
• مثال معني محمود

• نسبه الحب/ الكره
• نسبه الرجوله/ الانوثه 
• نسبه الذكـــــاء/ الغباء 

• الاوامــر بالـــرد  ⇣ 

• زواج ~ طلاك
        """,
        "dev": """
        اوامر المطور الاساسي

• تفعيل / تعطيل
• رفع / تنزيل ← مطور اساسي ، ثانوي ، مطور
• عرض / مسح المطورين
• تغيير المطور الاساسي

• تفعيل / الغاء الوضع المدفوع + الايدي
• حظر جروب + الايدي
• غادر + الايدي
• اسم بوتك + غادر
• الاشتراك الاجباري (تفعيل / تعطيل / تغيير)
• تعيين عدد الاعضاء + العدد

• حظر عام / الغاء العام
• كتم عام / الغاء كتم
• قائمه ومسح العام
• المكتومين عام / مسحهم

• تغيير / مسح اسم البوت
• ضع صوره للترحيب
• الاحصائيات
• اذاعه (عادي ، خاص ، توجيه ، تثبيت)

• جلب / رفع نسخه احتياطيه
• جلب / رفع نسخه الردود
• تفعيل جلب النسخه التلقائيه
• معلومات التنصيب

• تعيين / مسح ايدي عام
• اضف / مسح رد عام (مفرد ، متعدد)
• ضع / مسح ترحيب عام
• ضع / مسح كليشه المطور
• الصوتيات والردود العامه + مسحها
• منع عام / الغاء منع عام

• اداره الاسئله والالغاز وكت
• اداره الموسيقى + القائمه

• تفعيل / تعطيل (الخدمي ، المغادره ، الاذاعه ، التواصل ، الاحصائيات)
• ملف + اسم الملف
• المتجر ، الملفات
• تحديث السورس
• مسح جميع الملفات

اوامر مطور البوت

• رفع / تنزيل مالك
• المالكين / مسحهم
• تنزيل جميع الرتب
        """,
        "games": """
        🔺️╎ اهلا بك في { قسم } العاب السورس •
🔻╎ اختار اللعبه الي انت عايزها • ~
🔺️╎ من خلال الأزرار بالأسفل 👇 • ~
        """,
        "fun": """
        ︙اوامر التسليه كالاتي: 

• الامر ، تفعيل ، تعطيل ← { الامر }
• غنيلي ، ريمكس ، اغنيه ، شعر
• صوره ،  متحركه
• انمي ، ميمز
• مسلسل ، فلم
• حساب العمر( احسب + تاريخ الميلاد)
• معنى اسم + الاسم
        """,
    }
    await callback.message.edit_text(
        f"**{texts.get(data)}**",
        reply_markup=keyboard
    )
